CubeAdjoint/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-4.8 -3.2 -3.2)
    (14.4 -3.2 -3.2)
    (14.4  3.2 -3.2)
    (-4.8  3.2 -3.2)
    (-4.8 -3.2 3.2)
    (14.4 -3.2 3.2)
    (14.4  3.2 3.2)
    (-4.8  3.2 3.2)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (12 4 4) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    sym
    {
        type symmetry;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
            (4 5 6 7)
            (0 1 2 3)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
);


// ************************************************************************* //
